---
kind: method
id: M:Autodesk.Revit.DB.FailureHandlingOptions.GetFailuresPreprocessor
source: html/f0c9dd15-0f70-0e03-0126-2eb63bf8b9a9.htm
---
# Autodesk.Revit.DB.FailureHandlingOptions.GetFailuresPreprocessor Method

Gets the callback to be invoked in the beginning of failure processing.

## Syntax (C#)
```csharp
public IFailuresPreprocessor GetFailuresPreprocessor()
```

## Returns
The callback to be invoked in the beginning of failure processing.